{
  "LOGIN_ERROR": "Usuario o contraseña incorrectos. Por favor, revisa tus credenciales",
  "NOT_AUTHENTICATED": "No estás autentificado",
  "INVALID_TOKEN": "",
  "INVALID_TIMESTAMP": "El tiempo para realizar esta operación ha expirado",
  "INVALID_URL": "",
  "INVALID_EMAIL": "El email introducido  no es válido.",
  "INVALID_PASSWORD": "La contraseña que has introducido no cumple los requisitos",
  "EMAIL_ALREADY_EXISTS": "El email que has introducido ya existe",
  "INCORRECT_OLD_PASSWORD": "La contraseña introducida no es correcta",
  "POWER_RANGE_MISSING": "Debes incluir los rangos de potencia",
  "POWER_RANGE_INVALID": "El máximo no puede ser inferior al mínimo",
  "ENERGY_TYPE_INVALID": "Los rangos de potencia solo son para las energías de tipo luz",
  "RATE_TYPE_NOT_EXIST": "El tipo de tarifa no existe",
  "ENERGY_COST_NOT_EXIST": "El coste energético no existe",
  "ENERGY_COST_MODIFICATION_NOT_ALLOWED": "No tienes permisos para modificar este coste energético",
  "Not Found": "El endpoint no existe",
  "NEGATIVE_NUMBER": "El numero introducido no puede ser negativo",
  "NOT_EXIST": "El registro ya no existe",
  "CONSUMPTION_RANGE_OVERLAP": "Los rangos de consumo no pueden solaparse con los rangos existentes",
  "POWER_RANGE_OVERLAP": "Los rangos de potencia no pueden solaparse con los rangos existentes",
  "RESOURCE_ALREADY_EXISTS": "Ya existe un recurso con esa información",
  "RATE_TYPE_ALREADY_EXISTS": "Ya existe un tipo de tarifa con este tipo de energía y nombre",
  "value_error.any_str.max_length": "El texto introducido supera el máximo de caracteres permitidos",
  "SIPS_NOT_WORKING": "El sistema SIPS no está disponible. Por favor, inténtalo más tarde o deselecciona “Extraer consumo SIPS” y dale a Continuar para seguir en modo manual",
  "SIPS_NOT_FOUND": "CUPS no encontrado en SIPS. Verifica que esté bien escrito y vuelve a intentarlo o deselecciona la opción “Extraer consumos de SIPS” y continúa en modo manual",
  "MULTIPLE_SIPS": "Se han recibido datos para más de un CUPS. Por favor, selecciona uno con punto de frontera e introdúcelo en el campo CUPS para volver a conectar con SIPS",
  "EDIT_SUGGESTED_RATE_MARGIN": "Ha ocurrido un error al editar el margen de la tarifa sugerida",
  "value_error.applied_profit_margin.value_error": "El margen introducido está fuera del rango permitido para esa tarifa",
  "DEFAULT": "Ha ocurrido un error inesperado, por favor inténtalo de nuevo más tarde"
}
